{"sections":{"breadcrumbs_cXdDeD":{"type":"breadcrumbs","disabled":true,"settings":{"text_alignment":"center"}},"main":{"type":"main-page","settings":{"padding_top":28,"padding_bottom":28}},"custom_content_igDbtk":{"type":"custom-content","blocks":{"text_6VfVPA":{"type":"text","settings":{"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"<p><strong>DoorJammer Terms and Conditions* <\/strong><\/p><p>*Terms & Conditions vary by country. Please contact your local DoorJammer company for a copy of their terms and conditions of sale.<br\/>Definition: In these Conditions, Penn Elcom Limited, doing business as DoorJammer and its affiliates (‘’DoorJammer’’, ‘’we’’, ‘’us’’, or ‘’our’’), and “You” or “consumer” or ‘’customer’’ means the person, firm or company purchasing the goods.<br\/>Our Registered Address: Penn Elcom Limited, 1st Floor, Sackville House, 143-149 Fenchurch Street, London, EC3M 6BN. Registered in England and Wales<br\/>Company Number: 04768848<br\/>The conditions which apply to your purchase of goods from us<br\/>The conditions in Part I apply to your purchase of goods from us whether you are a consumer or not.<br\/>The conditions in Part II apply to your purchase of goods from us only if you are a consumer.<br\/>The conditions in Part III only apply to your purchase of goods from us if you are not a consumer.<br\/><\/p><p>UK: <br\/>Phillips House, Drury Lane, Ponswood Industrial Estate, Hastings, East Sussex, TN38 9BA, United Kingdom<\/p><p><\/p><p><\/p><p>-----------------<\/p><p>DoorJammer is part of the <a href=\"https:\/\/www.penn-elcom.com\/the-penn-elcom-group\" target=\"_blank\" title=\"https:\/\/www.penn-elcom.com\/the-penn-elcom-group\">Penn Elcom Group<\/a>.<\/p>","text_size":"text-sm","button_label":"","button_link":"","button_style":"btn--primary","content_alignment":"left","width":"100%","alignment":"center","block_custom_class":""}},"text_UXfUqK":{"type":"text","settings":{"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"<h5><strong>Part I<\/strong><\/h5><p>a) Consumer Rights<br\/>Penn Elcom trading as DoorJammer is a UK-based company that complies with UK consumer law, including the Distance Selling Regulations. Our Terms and Conditions do not affect your statutory rights. The Distance Selling Regulations give you the right to cancel an order and return any goods that may already have been dispatched, up to 7 days from receipt. The Penn Elcom returns policy allows 7 days.<\/p><p>b) VAT<br\/>Because we trade in the UK all prices on this site include VAT (Value Added Tax) at 20%. If you are shopping with us from outside the E.U. or a tax-exempt country such as the Channel Islands then this VAT does not apply. Our website will automatically display all prices with the VAT deducted, and you will be billed accordingly.<br\/><br\/>c) Card Payments, Security and Privacy<br\/>We accept most major credit cards, PayPal and Amazon Pay. Exchange rates around the world do vary all the time so payments made to Penn Elcom must always be in UK pounds (£) Sterling.<br\/>For remote addresses and international orders, your telephone number may be forwarded to our couriers to ensure receipt of your goods.<br\/>We update our stock daily and if an item is out of stock it will be displayed as such on the site. If there is a problem with availability, we will contact you within 24 hours of the order being made, in which case you have a choice of waiting until it is in stock. In any case, orders are not processed unless we have the item in stock.<br\/><\/p><p>d) Responsibilities<br\/>Certain products on our website can be hazardous and lead to serious injury if not used correctly. Only competent and informed persons who understand and accept the risks involved must use these products. Training in the proper use of equipment, techniques and safety measures in any of these products is the responsibility of the user, who must assume responsibility for all risks and damages, which may arise from the use of such equipment.<br\/>It is the responsibility of the buyer to ensure that all technical data and instructions provided with the product by the seller are supplied to the end user.<br\/><\/p><p>e) Disclaimer for site usage and Copyright<br\/>Penn Elcom disclaims damages of any kind, compensatory, direct, indirect or consequential damages, loss of data, income or profit, loss of or damage to property and claims of third parties implied or otherwise relating to the use of this site.<br\/>All pictures, material, code, intellectual property, and descriptions are the property of Penn Elcom Ltd and Shopify Inc. It may not be copied or used without the express permission of these parties.<br\/><\/p><p>f) Delivery of the goods<br\/>The price of the goods does not include delivery by us to you.<br\/>The costs of carriage and any insurance which you direct us to incur shall be reimbursed by you and shall be due on the date for payment of the price.<br\/>The goods shall be delivered by us to your address, and the risk in the goods shall pass to you upon such delivery taking place.<br\/>You should note that our carrier requires immediate notice to be given of any loss or damage to goods and you should inspect the goods upon receipt and report any loss or damage to the carrier immediately.<br\/>In so far as you report any transit damage to goods to us within 48 hours of delivery, we will refund the price and carriage or replace the goods at no cost to you.<br\/>In respect of any transit damage to goods reported to us after 48 hours of delivery, we shall require proof from you that the goods were damaged before receipt by you.<br\/><\/p>","text_size":"text-sm","button_label":"","button_link":"","button_style":"btn--primary","content_alignment":"left","width":"100%","alignment":"center","block_custom_class":""}},"text_nywk9p":{"type":"text","settings":{"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"<h5><strong>Part II<\/strong><\/h5><p>a) Payment and Price<br\/>We shall not be bound to deliver the goods until you have paid for them. The price due from you is the price indicated as inclusive of value-added tax. Payment of the price and value-added tax shall be due before delivery, for Credit Accounts within 30 days end of the month. Time for payment shall be of the essence.<\/p><p>b) Delivery<br\/>•\tWe will try to deliver the goods to you within the time estimated for delivery.<br\/>•\tIf we are unable to do so, we reserve the right to deliver them within 30 days beginning with the day after the day of the agreement between us.<br\/>•\tIf we are unable to deliver the goods to you within 30 days beginning with the day after the day of the agreement:<br\/>-\twe shall inform you by email<br\/>-\twe shall make a further offer to you by e-mail to sell you the goods of the specification and description at the price stated in the e-mail and will state the period for which the offer or the price remains valid<br\/>-\tunless you accept the offer, we will reimburse any sum paid by you or on your behalf under or in relation to the agreement within a period of 30 days beginning with the day after the day on which the time for delivery expired.<br\/><\/p><p>c) Your right of cancellation<br\/>The rights of cancellation set out below apply to any agreement between you and us.<br\/>•\tYou have a right to cancel the agreement at any time before the expiry of a period of 14 calendar days which begins on the day the goods are delivered.<br\/>•\tYou may cancel by giving us notice in any of the following ways:<br\/>-\tby a notice in writing which you leave at our address (given above);<br\/>-\tby a notice in writing which you send by post to our address (given above);<br\/>-\tby electronic mail to our electronic mail address onlineuk@penn-elcom.com<br\/>-\tand the notice shall operate to cancel the agreement between us<br\/><\/p><p>If you cancel the agreement:<br\/>•\tyou must return the goods to us at the address given above or as specified by our team upon contact;<br\/>•\tthe goods must be returned to us complete (please note the definition of goods given above);<br\/>•\tyou are responsible for the cost of returning the goods to us at the address given above or as specified by our team upon contact;<br\/>•\tyou are under a duty to take reasonable care of the goods (including reusable packaging, manuals etc.) until they are returned to us;<br\/>•\tyou are under a duty to take reasonable care to see that they are received by us and not damaged in transit;<br\/>•\twe will reimburse any sum paid by you or on your behalf under or in relation to the agreement including the costs of carriage and any insurance which you directed us to incur.<br\/>•\twe will charge you the direct costs to us of recovering any goods supplied by us if you fail to return the goods to us.<br\/><\/p><p>d) Our right of cancellation<br\/>If for reasons beyond our reasonable control, including but not limited to an inability or failure on the part of the manufacturers or suppliers of the goods to supply the goods to us, we are unable to supply the goods to you, we may cancel the agreement at any time before the goods are delivered by giving notice to you. We shall promptly repay to you any sums paid by you or on your behalf under or in relation to the agreement. We shall not be liable for any other loss or damage whatsoever arising from such cancellation.<br\/><\/p><p>e) Statutory rights<br\/>Your right of cancellation is in addition to your other statutory rights.<br\/>The after-sales service and guarantees for the return of goods by you to us mentioned below do not affect your statutory rights.<br\/><\/p><p>f) Guarantees and after-sales service<br\/>We guarantee that the goods will correspond with the stated description and specification.<br\/>We guarantee that the goods will be of satisfactory quality when delivered by our carrier.<br\/>The terms of any manufacturers’ guarantee and after-sales service will be included within the documents accompanying the goods.<br\/>We are willing to provide advice to you in accordance with the conditions below.<br\/><\/p><p>g) Advice given by us to you<br\/>We are always prepared to offer advice about the goods including advice about installation, compatibility, configuration, and product upgrades.<br\/>We know the general purpose for which you require our goods and we will take reasonable care when giving you any advice.<br\/><\/p><p>Without knowing the particular application for which you require our goods and the exact specification and configuration of any existing system into which you intend to install our goods, we cannot and do not warrant the suitability of any of our goods for your particular purpose.<\/p><p>h) Your responsibilities<br\/>It is your responsibility to ensure compatibility of any goods offered for sale by us both with the existing components within your system and with any other goods offered for sale by us.<br\/>It is your responsibility to ensure the proper installation of our goods into your existing system.<br\/><\/p>","text_size":"text-sm","button_label":"","button_link":"","button_style":"btn--primary","content_alignment":"left","width":"100%","alignment":"center","block_custom_class":""}},"text_gnxKXF":{"type":"text","settings":{"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"<h5><strong>Part III<\/strong><\/h5><p>a) Conditions applicable<br\/>These conditions shall apply to all contracts for the sale of goods by us to you to the exclusion of all other terms and conditions including any terms or conditions which you may purport to apply under any purchase order confirmation of order or similar document.<br\/>All orders for goods shall be deemed to be an offer by you to purchase goods pursuant to these conditions.<br\/>Acceptance of delivery of the goods shall be deemed conclusive evidence of your acceptance of these conditions.<br\/>Any variation to these Conditions (including any special terms and conditions agreed between you and us) shall be inapplicable unless agreed in writing by us.<br\/>These terms represent the entire agreement between you and us.<br\/><\/p><p>b) Price and payment<br\/>The price (unless otherwise expressly stated) shall be exclusive of value-added tax which shall be due at the rate ruling on the date of our invoice.<br\/>Where the price is expressed to be inclusive of value-added tax we have the right to adjust the price at any time before delivery to take account of any increase in value-added tax.<br\/>Interest on overdue invoices shall accrue from the date when payment becomes due from day to day until the date of payment at a rate of 8% above Barclays Bank plc's base rate from time to time in force and shall accrue at such a rate after as well as before any judgment.<br\/><br\/>If you fail to make any payment on the due date then without prejudice to any of our other rights we may:<br\/>•\tsuspend or cancel deliveries of any articles due to you; and\/or<br\/>•\tappropriate any payment made by you to such of the goods (or goods supplied under any other contract with you) as we may in our sole discretion think fit.<br\/><\/p><p>c) No set-off <br\/>You may not withhold payment of any invoice or other amount due to us by reason of any right of set-off or counterclaim which you may have or allege to have or for any other reason whatsoever.<br\/><\/p><p>d) Delivery and non-delivery of goods<br\/>The goods shall be delivered to you at your address. The risk in the goods shall pass to you upon such delivery taking place.<br\/>We shall arrange for carriage of the goods to your address. The costs of carriage and any insurance which you reasonably direct us to incur shall be reimbursed by you without any set-off or other withholding whatever and shall be due on the date for payment of the price. The carrier shall be deemed to be your agent.<br\/>We shall not be liable for any loss or damage whatever due to failure by us to deliver the goods or any of them promptly or at all.<br\/>Notwithstanding that we may have delayed or failed to deliver the goods or any of them promptly you shall be bound to accept delivery and to pay for the goods in full provided that delivery shall be tendered at any time within 1 month of the agreement.<br\/><\/p><p>e) Retention of title by us<br\/>The goods shall be at your risk as from delivery. In spite of delivery having been made property in the goods shall not pass to you until:<br\/>You have paid the price plus value-added tax in full; and no other sums whatever shall be due from you to us.<br\/>Until property in the goods passes to you, the goods and each of them shall be held by you on a fiduciary basis as bailee for us.<br\/>You shall store the goods (at no cost to us) separately from all other goods in your possession and marked in such a way that they are clearly identified as our property.<br\/>Notwithstanding that the goods (or any of them) remain our property, you may sell or use the goods in the ordinary course of your business at full market value for our account. Any such sale or dealing shall be a sale or use of our property by you on your own behalf, and you shall deal as principal when making such sales or dealings.<br\/>Until property in the goods passes from us the entire proceeds of sale or otherwise of the goods shall be held in trust for us and shall not be mixed with other money or paid into any overdrawn bank account and shall be at all material times identified as our money.<br\/>We shall be entitled to recover the price (plus value added-tax) notwithstanding that property in any of the goods has not passed from us.<br\/>Until such time as property in the goods passes from us you shall upon request deliver up to us such of the goods as have not ceased to be in existence or resold. If you fail to do so we may enter upon any premises owned occupied or controlled by you where the goods are located and repossess the goods. You authorize us to repossess the goods from any other premises where the goods may be situated from time to time provided always that we have the consent of the person who owns, occupies or controls such premises to enter thereon. On the making of a request by us to you to deliver up such goods your rights to sell, use or otherwise deal with the goods shall cease.<br\/>You shall not pledge or in any way charge by way of security for any indebtedness of any of the goods which are our property. Without prejudice to our other rights, if you do so all sums whatever owing by you to us shall forthwith become due and payable.<br\/>You shall insure and keep insured the goods to the full price against all risks to our reasonable satisfaction until the date that property in the goods passes from us, and shall whenever requested by us produce a copy of the policy of insurance. Without prejudice to our other rights, if you fail to do so all sums whatever owing by you to us shall forthwith become due and payable.<br\/>You shall promptly deliver the prescribed particulars of this contract to the Registrar in accordance with the Companies Act 1985 Part XII as amended. Without prejudice to our other rights, if you fail to do so all sums whatever owing by you to us shall forthwith become due and payable.<br\/><\/p><p>f) Acceptance of the goods<br\/>You shall be deemed to have accepted the goods 3 days after delivery to your carrier.<br\/>After acceptance, you shall not be entitled to reject goods which are not in accordance with the contract.<br\/><\/p><p>g) Rejection of the goods<br\/>If you properly reject any of the goods which are not in accordance with the contract you shall nonetheless pay the full price for such goods unless you return such goods to us at your cost before the date when payment of the price is due.<br\/><\/p><p>h) Return of goods which are in accordance with the contract<br\/>No goods delivered to you which are in accordance with the agreement will be accepted for return by us without our prior written approval (in accordance with our returns authorisation procedure) and on terms to be determined at our absolute discretion.<br\/>If we agree to accept any such goods for return you shall be liable to pay a handling charge of (20%) of the invoice price. Such goods must be returned by you to us carriage-paid and in the original packaging.<br\/>Goods which are in accordance with the agreement and are returned without our prior written approval, may at our absolute discretion be returned to you or stored at your cost without prejudice to any other rights or remedies we may have.<br\/><\/p><p>i) Variations in description or specification<br\/>We may deliver goods of a different description or specification from that agreed upon and as may be required to comply with any applicable safety or statutory requirements or which do not materially affect the quality or fitness for the purpose of the goods.<br\/><\/p><p>j) Limitations upon our liability to you<br\/>Our liability to you for any breach of contract or negligence (save and except our liability for negligence for death or personal injury) shall be limited to the price of the goods together with any expenses incurred by you in notifying us and returning the goods to us.<br\/>We shall not be liable for any consequential loss including without limitation any loss caused by interruption of your business, loss of electronic information or physical damage to property and whether directly or indirectly caused by any breach of contract or by negligence by us or by any servant or agent of ours.<\/p><p>k) Choice of law and jurisdiction<br\/>This contract is subject to the law of England and Wales.<br\/>All disputes arising out of this agreement shall be subject to the exclusive jurisdiction of the courts of England and Wales. If any part of these terms and conditions shall be found to be unlawful, it shall not affect the validity or enforceability of the remainder of the conditions.<br\/><\/p><p>l) Force Majeure<br\/>Neither party to this agreement shall be liable for failing to perform or delay of performance if the delay is caused by circumstances or events outside their reasonable control, which shall include but not be limited to industrial action, acts of God, terrorism, civil commotion, refusals to grant licences or permissions etc.<\/p><p><br\/>DoorJammer is a trading name of Penn Elcom Ltd. Penn Elcom Ltd is part of the Penn Elcom Group of companies.<br\/><br\/><\/p>","text_size":"text-sm","button_label":"","button_link":"","button_style":"btn--primary","content_alignment":"left","width":"100%","alignment":"center","block_custom_class":""}},"text_DtADHW":{"type":"text","settings":{"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"<h5><strong>Disclaimer<\/strong><\/h5><p>The DoorJammer is a security aid and is not a substitute for a standard door lock. Do not use on fire doors or emergency exits. Patent pending. Permission has been personally granted for DoorJammer to use all images and logos featured on this website. All images and logos on this site are protected by copyright and are not be used unless permission has been directly given by DoorJammer. All rights are reserved.<\/p><p><strong>READ THIS DOCUMENT BEFORE INSTALLING OR USING THE DOORJAMMER. IMPROPER USE OR FAILURE OF THE DOORJAMMER RESULTING THEREFROM CAN CAUSE DAMAGE TO EQUIPMENT OR PROPERTY, SERIOUS PERSONAL INJURY, OR DEATH.<\/strong><\/p><p>Since the use of the information contained in Penn Elcom Corporation product documentation, including this document, and the conditions under which Penn Elcom Corporation products are used are beyond the control of Penn Elcom Corporation, it is the obligation of each user of Penn Elcom Corporation products to carefully read and understand this document and all other documentation, instructions, and manuals supplied with Penn Elcom Corporation products and to determine the correct and safe methods of installation and operation of Penn Elcom Corporation products. In addition to the disclaimers and limitations of liability set forth below, in no event may Penn Elcom Corporation be held responsible for unsafe or incorrect installation and operation of the DoorJammer or for any property damage or personal injuries arising out of the incorrect use or handling of the DoorJammer.<\/p>","text_size":"text-sm","button_label":"","button_link":"","button_style":"btn--primary","content_alignment":"left","width":"100%","alignment":"center","block_custom_class":""}},"text_Jf6mtt":{"type":"text","settings":{"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"<h5><strong>Disclaimer Of Warranties<\/strong><\/h5><p>USERS' USE OF THE DOORJAMMER IS AT THEIR SOLE RISK, EXCEPT FOR ANY EXPRESS LIMITED WARRANTY THAT MAY BE PROVIDED. EXPRESSLY DISCLAIMS, TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, ALL WARRANTIES OF ANY KIND, WHETHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR ARISING BY STATUTE OR OTHERWISE IN LAW OR FROM A COURSE OF DEALING OR USAGE OF TRADE. NO ADVICE OR INFORMATION, WHETHER ORAL OR WRITTEN, OBTAINED BY YOU FROM PENN ELCOM CORPORATION OR CONTAINED IN THIS DOCUMENT OR ANY OF PENN ELCOM CORPORATION PRODUCT DOCUMENTATION, SHALL CREATE ANY WARRANTY. LIMITATION OF LIABILITY. [OTHER THAN REMEDIES THAT ARE GRANTED UNDER ANY EXPRESS LIMITED WARRANTY THAT MAY BE PROVIDED FOR SPECIFIC PENN ELCOM CORPORATION PRODUCTS,] PENN ELCOM CORPORATION SHALL NOT BE LIABLE FOR, NOR SHALL YOU MAKE ANY CLAIM FOR (WHETHER BASED ON CONTRACT, TORT, PRODUCTS LIABILITY, STRICT OR STATUTORY LIABILITY, NEGLIGENCE OR OTHERWISE), ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL, PUNITIVE, OR EXEMPLARY DAMAGES (EVEN IF PENN ELCOM CORPORATION HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES) ARISING OUT OF USE OF PENN ELCOM CORPORATION PRODUCTS, INCLUDING, BUT NOT LIMITED TO, DAMAGES FOR ECONOMIC LOSS OF PROFITS OR SAVINGS; LOST WAGES; DAMAGES TO OR LOSS OF USE OF PROPERTY; BODILY INJURY; MEDICAL PAYMENTS; PAIN AND SUFFERING; AND LOSS OF CONSORTIUM. IN THE EVENT THAT APPLICABLE LAW DOES NOT ALLOW THE EXCLUSION OF WARRANTIES STATED HEREIN OR THE LIMITATION OF LIABILITY STATED HEREIN, THEN YOU EXPRESSLY AGREE THAT IN NO EVENT WILL THE LIABILITY OF PENN ELCOM CORPORATION, FOR ANY CLAIM OR DAMAGES HEREUNDER EXCEED THE PURCHASE PRICE PAID FOR THE PENN ELCOM CORPORATION PRODUCT IN CONTROVERSY.<\/p>","text_size":"text-sm","button_label":"","button_link":"","button_style":"btn--primary","content_alignment":"left","width":"100%","alignment":"center","block_custom_class":""}}},"block_order":["text_6VfVPA","text_UXfUqK","text_nywk9p","text_gnxKXF","text_DtADHW","text_Jf6mtt"],"settings":{"container":"fixed","color_scheme":"","enable_sticky_column":false,"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"","column_gap":"medium","row_gap":"large","swipe_on_mobile":false,"columns_mobile":"1","padding_top":50,"padding_bottom":50,"show_section_divider":false,"divider_width":"fixed"}},"products_showcase_9GydiY":{"type":"products-showcase","settings":{"color_scheme":"","heading":"","heading_size":"h2","heading_highlight_style":"none","products":["doorjammer-portable","doorjammer-lockdown"],"pcard_title_size":"h1","pcard_description_display":"3-lines","pcard_description_size":"text-lg","pcard_image_ratio":"","pcard_show_vendor":false,"pcard_show_type":false,"pcard_button_label":"Shop this product","padding_top":50,"padding_bottom":50,"show_section_divider":true,"divider_width":"fixed"}},"recently_viewed_products_dAV6fY":{"type":"recently-viewed-products","disabled":true,"settings":{"color_scheme":"","heading":"Recently viewed products","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"","limit":8,"columns":4,"column_gap":"large","row_gap":"inherit","enable_slider":true,"controls_position":"inside","pcard_image_ratio":"","columns_mobile":"1","swipe_on_mobile":true,"padding_top":50,"padding_bottom":50,"show_section_divider":true,"divider_width":"fixed"}}},"order":["breadcrumbs_cXdDeD","main","custom_content_igDbtk","products_showcase_9GydiY","recently_viewed_products_dAV6fY"]}