{"sections":{"breadcrumbs_cXdDeD":{"type":"breadcrumbs","disabled":true,"settings":{"text_alignment":"center"}},"main":{"type":"main-page","settings":{"padding_top":28,"padding_bottom":28}},"custom_content_igDbtk":{"type":"custom-content","blocks":{"text_6VfVPA":{"type":"text","settings":{"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"<p>The DoorJammer is a unique and convenient security aid. It is a simple and efficient way to provide privacy and security, by preventing unwanted intrusions.<\/p><p>If you have any queries about our Privacy Policy, please don't hesitate to <a href=\"https:\/\/door-jammer.co.uk\/contact-us\/\">contact us<\/a><\/p>","text_size":"text-base","button_label":"","button_link":"","button_style":"btn--primary","content_alignment":"left","width":"100%","alignment":"center","block_custom_class":""}},"text_RprqbR":{"type":"text","settings":{"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"<p><strong>Who We Are<\/strong><\/p><p>The DoorJammer is a unique, new and convenient security aid. It is a simple and efficient way to provide privacy and security, by preventing unwanted intrusions.<br\/>DoorJammer is a trading name of Penn Elcom Ltd. Penn Elcom Ltd is part of the <a href=\"https:\/\/www.penn-elcom.com\/the-penn-elcom-group\" target=\"_blank\" title=\"https:\/\/www.penn-elcom.com\/the-penn-elcom-group\">Penn Elcom Group<\/a> of companies.<br\/><br\/>Penn Elcom Limited is a UK-registered limited company (no. 04768848). The registered address is 1st Floor Sackville House, 143-149 Fenchurch Street, London, England, EC3M 6BN.<br\/><br\/>If you have any questions about how we look after your personal data, you can contact us:<br\/>In writing, at the address: DoorJammer \/ Penn Elcom Ltd, Philips House, Drury Lane, St Leonards-on-Sea, East Sussex, TN38 9BA. Please mark your letter for the attention of the Privacy Compliance Officer.<br\/>By email to this address: salesuk@door-jammer.com<br\/>By telephone: +44 (0) 1424 239284<br\/>By post to the address indicated in the below Section 2 – Consent<br\/><br\/>If you are a resident of North America, your relationship is with Penn Elcom Inc trading as DoorJammer. and the laws of California and the United States apply. For additional information please see below Section 10 - Additional US State Privacy Rights. <br\/>We are registered in the United States and have our registered office at: 7465 Lampson Avenue, Garden Grove, California, 92841, USA.<br\/>If you have any questions about how we look after your personal data, you can contact us:<br\/>In writing, at the address: DoorJammer \/ Penn Elcom Inc, 7465 Lampson Avenue, Garden Grove, California, 92841, USA. <br\/>By email to this address: sales@door-jammer.com<br\/>By telephone: +1 512 992 1354<br\/><br\/>If you reside outside of North America, your relationship is with Penn Elcom Limited trading as DoorJammer, which is the controller with regard to your personal information collected by Penn Elcom, and the laws of UK apply.<br\/><\/p>","text_size":"text-sm","button_label":"","button_link":"","button_style":"btn--primary","content_alignment":"left","width":"100%","alignment":"center","block_custom_class":""}},"text_UXfUqK":{"type":"text","settings":{"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"Privacy Policy Information","description":"<p><strong>SECTION 1 - PERSONAL INFORMATION<br\/><\/strong><br\/>‘Personal information’ refers to any information which can identify an individual – either directly or indirectly. It can refer, amongst other things, to a customer ID, or to one or more specific identifying pieces of information, such as a name, email address or postal address.<br\/><br\/><strong>What Personal Information do you collect about me?<\/strong><br\/>When you browse our website or carry out actions such as the following:<br\/>-\tCreate a customer account<br\/>-\tPlace an order<br\/>-\tSign up to our mailing list or subscribe to any other services that we offer<br\/>-\tEnter any competition, promotion or prize draw<br\/>-\tCorrespond with us, whether by phone, email or live chat<br\/>-\tAsk for a quotation<br\/><br\/>Then, we may collect your personal information, including:<br\/>-\tName<br\/>-\tDate of birth<br\/>-\tGender<br\/>-\tAddress<br\/>-\tEmail address<br\/>-\tPhone or mobile number<br\/>-\tEncrypted password and payment information<br\/>-\tCustomer service correspondence records<br\/>-\tTechnical information about how you access and use our websites, including your IP address, browser type, referring URL and operating system.<br\/>-\tCookies - for more information see below.<br\/><br\/><strong>What is done with this information?<\/strong><br\/>We use your information for the following:<br\/>•\tTo process your orders. We use relevant personal information described above (including your name, address and payment details) to process and deliver your order, add payments or refunds and to notify you of the status of your order.<br\/>•\tTo provide customer support. If you contact our customer service (or vice versa), we will use your identification information to identify you and other personal information such as your order information and contact history to process your request and provide you with the best service possible. We'll use your personal information to keep a record of when and why you contacted us and to keep your contact details up-to-date.<br\/>•\tTo answer sales enquiries. In order to create a quotation to send, or fulfil the obligation of the enquiry, you will be asked for a minimum of: name, email, address, phone number.<br\/>•\tTo improve our website and services. We use your personal information to help analyse and understand how you use our products and services, to develop more interesting and relevant products and services, to improve our website, as well as to personalise the products and services we offer you.<br\/>•\tFraud prevention. To prevent or detect fraud or abuses of our sites.<br\/>•\tMarketing. If you consent, we will use your information to notify you of products or special offers that may be of interest to you. We will send direct marketing communications to you via the channel you choose, such as email, phone, or social media. We ask for your consent, where required by applicable law, in order to use the contact details you have provided to us to send personalised marketing or retargeting communications. Please see below for more information on third parties and cookies used to provide these services.<br\/><br\/><strong>How long will you keep my information?<\/strong><br\/>-\tCustomer and order information will be kept securely on our system until you ask us to remove it. Note: Purchase information retention is subject to regulatory mandates we must adhere to e.g. data retention requirements for tax reporting purchases.<br\/>-\tEncrypted Credit Card information will be purged every 365 days.<br\/>-\tMailing List Subscriptions will remain active until you opt-out from specific lists.<br\/>-\tCookies - please refer to the section below or click here for more information on cookies and cookie duration.<br\/><\/p>","text_size":"text-sm","button_label":"","button_link":"","button_style":"btn--primary","content_alignment":"left","width":"100%","alignment":"center","block_custom_class":""}},"text_ezxdCR":{"type":"text","settings":{"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"<p><strong>SECTION 2 - CONSENT<br\/><\/strong><br\/><strong>How do you get my consent?<\/strong><br\/>When you provide us with personal information to complete a transaction, verify your credit card, place an order, arrange for a delivery or return a purchase, we imply that you consent to our collecting it and using it for that specific reason only.<br\/>If we ask for your personal information for marketing purposes, e.g. to offer you special discounts, we will request your permission explicitly, if not already granted.<br\/><br\/><strong>How do I withdraw my consent?<\/strong><br\/>If after you opt-in, if you change your mind, you may withdraw your consent to marketing communications. Marketing will be terminated and any data specifically used for marketing purposes alone will be deleted.<br\/>Financial transaction data will be maintained as required by law.<br\/><br\/>You may opt-out by clicking the unsubscribe link on our newsletter emails, contacting us at salesuk@door-jammer.com or mailing us at:<br\/>Privacy Compliance Officer<br\/>DoorJammer \/ Penn Elcom Ltd<br\/>Philips House, Drury Lane<br\/>St Leonards-on-Sea<br\/>East Sussex, TN38 9BA<br\/><br\/>For US customers, you may opt out by clicking the unsubscribe link on our newsletter emails, contacting us at sales@door-jammer.com or mailing us at:<br\/>DoorJammer \/ Penn Elcom Inc<br\/>7465 Lampson Avenue<br\/>Garden Grove, <br\/>California, <br\/>92841, USA.<br\/><\/p>","text_size":"text-sm","button_label":"","button_link":"","button_style":"btn--primary","content_alignment":"left","width":"100%","alignment":"center","block_custom_class":""}},"text_wXFDNC":{"type":"text","settings":{"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"<p><strong>SECTION 3 - DISCLOSURE<br\/><\/strong><br\/>We may disclose your personal data to any member of our group, which means our subsidiaries or our ultimate holding company and its subsidiaries as defined in section 1159 of the UK Companies Act 2006.<br\/>As part of our GDPR compliance obligations, we are duty-bound to check when personal data may be shared with third parties to ensure that they apply the same or greater controls in terms of data protection. The use of non-disclosure agreements forms part of our third-party data-sharing controls.<br\/> We may disclose your personal data to third parties in the following circumstances:<br\/>-\tDuring changes to our business structure. If we engage in a merger, acquisition, bankruptcy, dissolution, reorganisation, sale of all or some of our assets, financing, acquisition of all or a portion of our business, a similar transaction or proceeding, or steps in contemplation of such activities (e.g. due diligence)<br\/>-\tTo comply with laws. To comply with legal or regulatory requirements and to respond to lawful requests, court orders and legal processes.<br\/>-\tTo enforce our rights, prevent fraud and for safety. To protect and defend the rights, property, or safety of us or third parties, including enforcing contracts or policies, or in connection with investigating and preventing fraud.<br\/>-\tTo fulfil our obligations under our agreement with you, e.g. provide your address to the courier to have your purchases delivered.<br\/><\/p>","text_size":"text-sm","button_label":"","button_link":"","button_style":"btn--primary","content_alignment":"left","width":"100%","alignment":"center","block_custom_class":""}}},"block_order":["text_6VfVPA","text_RprqbR","text_UXfUqK","text_ezxdCR","text_wXFDNC"],"settings":{"container":"fixed","color_scheme":"","enable_sticky_column":false,"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"","column_gap":"medium","row_gap":"large","swipe_on_mobile":false,"columns_mobile":"1","padding_top":50,"padding_bottom":80,"show_section_divider":false,"divider_width":"fixed"}},"custom_content_ydmf9m":{"type":"custom-content","blocks":{"text_Aa4tQk":{"type":"text","settings":{"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"<p><strong>SECTION 4 - Shopify<\/strong><\/p><p>Our store is hosted by Shopify. They provide us with the online e-commerce platform that allows you to buy our products and use our services.<br\/>Your data is stored through Shopify’s data storage, databases and the general Shopify application. They store your data on a secure server behind a firewall.<br\/>Payment through our website can be made via our secure checkout pages using secure 3rd party payment service providers, e.g. credit card processors.<br\/>Shopify is PCI compliant. PCI-DSS requirements help ensure the secure handling of credit card information by our store and its service providers.<\/p>","text_size":"text-sm","button_label":"","button_link":"","button_style":"btn--primary","content_alignment":"left","width":"100%","alignment":"center","block_custom_class":""}},"text_rg7kJb":{"type":"text","settings":{"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"<p><strong>SECTION 5 - THIRD-PARTY SERVICES<br\/><\/strong><br\/>In general, the third-party providers used by us will only collect, use and disclose your information to the extent necessary to allow them to perform the services they provide to us. E.g. Couriers to deliver your purchases.<br\/>However, certain third-party service providers, such as payment gateways and other payment transaction processors, have their own privacy policies with respect to the information we are required to provide to them for your purchase-related transactions.<br\/>In particular, remember that certain providers may be located in or have facilities that are located in a different jurisdiction than either you or us. So if you elect to proceed with a transaction that involves the services of a third-party service provider other legal obligations may be placed upon them by the laws of their jurisdiction.<br\/><br\/><strong>Links <\/strong>- When you click on links on our store, they may direct you away from our site. We are not responsible for the privacy practices of other sites and encourage you to read their privacy statements.<br\/><\/p>","text_size":"text-sm","button_label":"","button_link":"","button_style":"btn--primary","content_alignment":"left","width":"100%","alignment":"center","block_custom_class":""}},"text_4GhKrC":{"type":"text","settings":{"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"<p><strong>SECTION 6 - SECURITY<br\/><\/strong><br\/>To protect your personal information, we take reasonable precautions and follow industry best practices to make sure it is not inappropriately lost, misused, accessed, disclosed, altered or destroyed.<br\/>If you provide us with your credit card information, the information is encrypted using secure socket layer technology (SSL). We follow all PCI-DSS Level 1 requirements and implement additional generally accepted industry standards.<br\/><\/p>","text_size":"text-sm","button_label":"","button_link":"","button_style":"btn--primary","content_alignment":"left","width":"100%","alignment":"center","block_custom_class":""}},"text_Xc6xNN":{"type":"text","settings":{"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"<p><strong>SECTION 7 - COOKIES<br\/><\/strong><br\/>A Cookie is a small file that resides on your computer’s hard drive and often contains an anonymous unique identifier and is accessible only by the website that placed it there, not any other sites. Cookies are not computer programs, and can't read other information saved on your hard drive. They cannot be used to disseminate viruses or get a user's email address etc. They only contain and transfer to the website as much information as the users themselves have disclosed to that website.<br\/>Most On-Line retailers use cookies. Adobe Commerce uses Cookies to let us know you are a prior customer and thus you will not need to re-enter certain information every time you shop at the site. We do not use cookies to store credit card numbers, address information or any other personal information.<br\/>You may delete Cookies, however, you may lose any information that enables you to access the website more quickly or enjoy a custom experience. You can choose to enable or disable Cookies in your web browser.  By default, your browser will accept Cookies, however this can be altered. For further details please consult the help menu in your browser.  Disabling Cookies may prevent you from using the full range of Services available on the website.<br\/><br\/><strong>From 26th May 2012 and in line with EU Cookie Directive, you can view details of types of Cookies that may be used on our website.  To view details of these cookies please click here.<\/strong><br\/><\/p>","text_size":"text-sm","button_label":"","button_link":"","button_style":"btn--primary","content_alignment":"left","width":"100%","alignment":"center","block_custom_class":""}},"text_mDVH6A":{"type":"text","settings":{"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"<p><strong>SECTION 8 - CHANGES TO THIS PRIVACY POLICY<br\/><\/strong><br\/>We reserve the right to modify this privacy policy at any time, so please review it frequently. Changes and clarifications will take effect immediately upon their posting on the website. If we make material changes to this policy, we will notify you here that it has been updated, so that you are aware of what information we collect, how we use it, and under what circumstances, if any, we use and\/or disclose it.<br\/>If our store is acquired or merged with another company, your information may be transferred to the new owners so that we may continue to sell products to you.<\/p>","text_size":"text-sm","button_label":"","button_link":"","button_style":"btn--primary","content_alignment":"left","width":"100%","alignment":"center","block_custom_class":""}}},"block_order":["text_Aa4tQk","text_rg7kJb","text_4GhKrC","text_Xc6xNN","text_mDVH6A"],"settings":{"container":"fixed","color_scheme":"","enable_sticky_column":false,"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"","column_gap":"medium","row_gap":"large","swipe_on_mobile":false,"columns_mobile":"1","padding_top":0,"padding_bottom":80,"show_section_divider":false,"divider_width":"fixed"}},"custom_content_MptccH":{"type":"custom-content","blocks":{"text_iPVCHp":{"type":"text","settings":{"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"<p><strong>SECTION 9 - YOUR RIGHTS<\/strong><\/p><p>We reserve the right to modify this privacy policy at any time, so please review it frequently. Changes and clarifications will take effect immediately upon their posting on the website. If we make material changes to this policy, we will notify you here that it has been updated, so that you are aware of what information we collect, how we use it, and under what circumstances, if any, we use and\/or disclose it.<br\/>-\tRight to be informed. About the collection and use of your personal data<br\/>-\tRight of access. To what data is held about you and how it's being used<br\/>-\tRight to rectification. If any personal data is incorrect<br\/>-\tRight to erasure. Should you wish your details to be removed from our systems, also referred to as the ‘right to be forgotten’<br\/>-\tRight to restrict processing. You can request the restriction of personal data if certain criteria under the GDPR are met<br\/>-\tRight to object. To personal data being used for legitimate interests, direct marketing and research and statistics.<br\/>-\tRight to opt out of automated decision making<br\/><\/p>","text_size":"text-sm","button_label":"","button_link":"","button_style":"btn--primary","content_alignment":"left","width":"100%","alignment":"center","block_custom_class":""}},"text_FzCyhF":{"type":"text","settings":{"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"<p><strong>SECTION 10 - ADDITIONAL US STATE PRIVACY RIGHTS<\/strong><\/p><p>Some states in the US have passed state specific privacy laws. This section supplements our Privacy Policy by explaining your privacy rights if you are a resident in one of these states, provides certain mandated disclosures about our treatment of personal information:<br\/><strong><br\/>Colorado, Connecticut, Utah, and Virginia:<\/strong><br\/>If you are a resident of Colorado, Connecticut, Utah, or Virginia, we have certain obligations, and you have certain rights with respect to your personal information, including:<br\/>- Right to confirm whether the controller is processing the consumer’s personal information and the right to access such information<br\/>- Right to correct inaccuracies in personal information<br\/>- Right to delete personal information<br\/>- Right of data portability<br\/>- Right to opt out from targeted advertising<br\/>- Right to opt out from the sale of personal information<br\/><br\/>In certain states, you also have the right to opt out from profiling in furtherance of decisions that produce legal or similarly significant effects on the consumer (such as Virginia, Colorado, and Connecticut) and appeal a decision regarding a request to exercise your rights.<br\/>If you wish to exercise one or more of these rights, please review Section 9 - Your rights. If you would like to opt out of targeted advertising or the sale of personal information please see the instructions below.<br\/><br\/><strong>California<\/strong><br\/>In addition to the information described in our Privacy Policy, the California Consumer Privacy Act of 2018 (as amended by the California Privacy Rights Act of 2021) (“CCPA”) also requires us to provide California consumers with some additional information related to how we collect, use, retain, and disclose personal information as well as describe additional rights, which are summarized below.<br\/><br\/><strong>California Privacy Policy Disclosures:<\/strong><br\/>We collect, use, disclose, and retain personal information as described in the above Section 1- Personal Information of our Privacy Policy. <br\/><br\/><strong>Sensitive Personal Information:<\/strong><br\/>We use and disclose sensitive personal information for the limited purposes permitted under CCPA and not for the purposes of inferring characteristics about a consumer.<br\/><br\/><strong>Retention and Deletion:<\/strong><br\/>Please review the “How long will you keep my information?” in Section 1- Personal information of our Privacy Policy for more information about how long we retain personal information.<\/p><p><strong>California Privacy Rights:<\/strong><br\/>California consumers have certain rights with respect to their personal information. These rights include the following:<br\/>1.\tRight to opt out of “selling” or “sharing” certain Personal Information. WE DO NOT SELL OR SHARE ANY OF YOUR PERSONAL INFORMATION<br\/>2.\tRight to Know or Request Categories of Personal Information<br\/>You have a right to request that we disclose to you the personal information we have collected about you. You also have a right to request additional information about our collection, use, disclosure of such personal information such as a list of the categories of personal information collected about you, and other related information such as the source of the information. We have provided this information in the Privacy Policy.<br\/>3.\tRight to Correct.<br\/>You have a right to request correction of inaccurate personal information.<br\/>4.\tRight to Request Deletion.<br\/>You also have a right to request that we delete personal information under certain circumstances, subject to certain exceptions.<br\/>5.\tRight to Designate an Authorized Agent.<br\/>You may designate an authorized agent to exercise some of your rights; however, in order to help protect the security of your personal information, the authorized agent must follow the same procedures that are required if you exercise your rights without using an agent. We will verify requests made through authorized agents to help ensure the safety of your account and to comply with our policies and procedures.<br\/>6.\tRight against Discrimination.<br\/>You have a right to not be discriminated against for exercising your rights set out in the CCPA.<br\/>7.\tRight to Notice.<br\/>You have a right to receive notice of our practices at or before collection of personal information.<br\/>Additional information on exercising your rights:<br\/>You have the right to exercise the rights listed above and in our Privacy Policy free of charge or penalty. You may exercise many of these rights yourself by adjusting your preferences as outlined on the Your Privacy, or you can <a href=\"\/pages\/contact\" title=\"Contact\">get in touch with us<\/a>.<br\/><br\/>Privacy Contact:<br\/>Please refer to the ‘Who We Are’ section for details on how to <a href=\"\/pages\/contact\" title=\"Contact\">contact us<\/a> if you have a privacy question, concern or request. <\/p>","text_size":"text-sm","button_label":"","button_link":"","button_style":"btn--primary","content_alignment":"left","width":"100%","alignment":"center","block_custom_class":""}},"text_VgxPAd":{"type":"text","settings":{"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"<p><strong>QUESTIONS AND CONTACT INFORMATION<br\/><\/strong><br\/>In compliance with The EU GDPR Directive 25th May 2018, if you would like to: access, correct, amend or delete any personal information we have about you, register a complaint, or simply want more information, contact our Privacy Compliance Officer by email or post at the address given in the ‘Who We Are’ section above.<br\/><br\/>If you have any queries about our Privacy Policy, please don't hesitate to <a href=\"\/pages\/contact\" title=\"Contact\">contact us<\/a>.<br\/><\/p>","text_size":"text-sm","button_label":"","button_link":"","button_style":"btn--primary","content_alignment":"left","width":"100%","alignment":"center","block_custom_class":""}},"text_cRMwW3":{"type":"text","settings":{"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"<p><strong>Cookie Information<\/strong><\/p><p>Cookies are small bits of text used by a browser to store information on your computer’s hard drive. Each cookie can only be read by the web server that originally issued it. Cookies cannot profile your system or collect information from your hard drive. Most Online retailers use cookies. DoorJammer uses Cookies to let us know you are a prior customer and thus you will not need to re-enter certain information every time you shop at the site. We do not use cookies to store credit card numbers, address information or any other personal information.<\/p>","text_size":"text-sm","button_label":"","button_link":"","button_style":"btn--primary","content_alignment":"left","width":"100%","alignment":"center","block_custom_class":""}}},"block_order":["text_iPVCHp","text_FzCyhF","text_VgxPAd","text_cRMwW3"],"settings":{"container":"fixed","color_scheme":"","enable_sticky_column":false,"heading":"","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"","column_gap":"medium","row_gap":"large","swipe_on_mobile":false,"columns_mobile":"1","padding_top":0,"padding_bottom":80,"show_section_divider":false,"divider_width":"fixed"}},"products_showcase_9GydiY":{"type":"products-showcase","disabled":true,"settings":{"color_scheme":"","heading":"","heading_size":"h2","heading_highlight_style":"none","products":["doorjammer-portable","doorjammer-lockdown"],"pcard_title_size":"h1","pcard_description_display":"3-lines","pcard_description_size":"text-lg","pcard_image_ratio":"","pcard_show_vendor":false,"pcard_show_type":false,"pcard_button_label":"Shop this product","padding_top":50,"padding_bottom":50,"show_section_divider":true,"divider_width":"fixed"}},"recently_viewed_products_dAV6fY":{"type":"recently-viewed-products","disabled":true,"settings":{"color_scheme":"","heading":"Recently viewed products","heading_size":"h1","heading_highlight_style":"none","subheading":"","description":"","limit":8,"columns":4,"column_gap":"large","row_gap":"inherit","enable_slider":true,"controls_position":"inside","pcard_image_ratio":"","columns_mobile":"1","swipe_on_mobile":true,"padding_top":50,"padding_bottom":50,"show_section_divider":true,"divider_width":"fixed"}}},"order":["breadcrumbs_cXdDeD","main","custom_content_igDbtk","custom_content_ydmf9m","custom_content_MptccH","products_showcase_9GydiY","recently_viewed_products_dAV6fY"]}